/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.cpp                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: seb <seb@student.42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/06/02 11:06:52 by seb               #+#    #+#             */
/*   Updated: 2025/06/02 11:19:44 by seb              ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../zombie.hpp"

int main(void)
{
    Zombie *z = newZombie("bertrand");
    if (!z)
        return (0);
    z->announce();
    randomChump("léon");
    randomChump("");
    delete(z);
}